In [2]:
import pandas as pd
df=pd.read_csv("myfamily.csv")
df
print("groupby")

print(df.groupby(['gender']))

#viewing group
df

groupby
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000016CC737C790>

       name  age  gender  phone branch
0      jaga   30  female    233    cse
1   keerthi   18  female    630    cse
2  prasanna   17  female    730    cse
3     venky   19  female    427    ece
4    aswini   15  female    908  civil
5      gopi   13    male    574   mech
6     madhu   27    male    345    ece

In [4]:
import pandas as pd
dp=pd.read_csv("employees.csv")
dp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,08-06-1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,03-04-2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [16]:
print("groupby")

print(df.groupby(['gender']))

#viewing groups
print(df.groupby['gender'].groups())

groupby
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001BA6F42A820>

TypeError: 'method' object is not subscriptable

# displaying grouped value

In [20]:
c=df.groupby(['gender'])
print(c.get_group('female'))

       name  age  gender  phone branch
0      jaga   30  female    233    cse
1   keerthi   18  female    630    cse
2  prasanna   17  female    730    cse
3     venky   19  female    427    ece
4    aswini   15  female    908  civil

In [21]:
d=df.groupby(['gender'])
print(d.get_group('male'))

    name  age gender  phone branch
5   gopi   13   male    574   mech
6  madhu   27   male    345    ece

In [35]:
print(df.groupby(['gender']).groups)

{'female': [0, 1, 2, 3, 4], 'male': [5, 6]}

In [25]:
print("after grouping ,perform agrigate function-summarization")
print(df.groupby(['gender']).max())

after grouping ,perform agrigate function-summarization
         name  age  phone branch
gender
female  venky   30    908    ece
male    madhu   27    574   mech

pritn(c.min())

In [27]:
print(c.min())

print("group by gender is asigned to c")

          name  age  phone branch
gender
female  aswini   15    233  civil
male      gopi   13    345    ece
group by gender is asigned to c

In [28]:
print(df.groupby(['gender']).min())

          name  age  phone branch
gender
female  aswini   15    233  civil
male      gopi   13    345    ece

In [29]:
print(df.groupby(['gender']).sum())

        age  phone
gender
female   99   2928
male     40    919

In [31]:
print(df.groupby(['gender']).mean())

print(df.groupby(['gender']).count())

         age  phone
gender
female  19.8  585.6
male    20.0  459.5
        name  age  phone  branch
gender
female     5    5      5       5
male       2    2      2       2

In [34]:
print("grouping 2 colums")
a=df.groupby(['gender','branch'])
print(a)
a.first()

grouping 2 colums
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001BA6F42A7C0>

                 name  age  phone
gender branch
female civil   aswini   15    908
       cse       jaga   30    233
       ece      venky   19    427
male   ece      madhu   27    345
       mech      gopi   13    574

In [36]:
print(a.groups)

{('female', 'civil'): [4], ('female', 'cse'): [0, 1, 2], ('female', 'ece'): [3], ('male', 'ece'): [6], ('male', 'mech'): [5]}

In [38]:
print(df.groupby(['gender','branch']).max())
#above same as below
print(a.max())

                   name  age  phone
gender branch
female civil     aswini   15    908
       cse     prasanna   30    730
       ece        venky   19    427
male   ece        madhu   27    345
       mech        gopi   13    574
                   name  age  phone
gender branch
female civil     aswini   15    908
       cse     prasanna   30    730
       ece        venky   19    427
male   ece        madhu   27    345
       mech        gopi   13    574

In [40]:
print(df.groupby(['gender','branch']).min())

v=a.min()
v

                 name  age  phone
gender branch
female civil   aswini   15    908
       cse       jaga   17    233
       ece      venky   19    427
male   ece      madhu   27    345
       mech      gopi   13    574

                 name  age  phone
gender branch
female civil   aswini   15    908
       cse       jaga   17    233
       ece      venky   19    427
male   ece      madhu   27    345
       mech      gopi   13    574

In [43]:
b=df.groupby(['gender','branch','age'])
print(b)

b.first()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001BA6F42AFD0>

                       name  phone
gender branch age
female civil  15     aswini    908
       cse    17   prasanna    730
              18    keerthi    630
              30       jaga    233
       ece    19      venky    427
male   ece    27      madhu    345
       mech   13       gopi    574

In [44]:
d=df.groupby(['branch','gender','age'])
d.first()

                       name  phone
branch gender age
civil  female 15     aswini    908
cse    female 17   prasanna    730
              18    keerthi    630
              30       jaga    233
ece    female 19      venky    427
       male   27      madhu    345
mech   male   13       gopi    574

In [46]:
print(d.groups)

{('civil', 'female', 15): [4], ('cse', 'female', 17): [2], ('cse', 'female', 18): [1], ('cse', 'female', 30): [0], ('ece', 'female', 19): [3], ('ece', 'male', 27): [6], ('mech', 'male', 13): [5]}

In [47]:
print(df.groupby(['branch','gender','age']).max())

print(df.groupby(['branch','gender','age']).min())

print(df.groupby(['branch','gender','age']).sum())

print(df.groupby(['branch','gender','age']).mean())

                       name  phone
branch gender age
civil  female 15     aswini    908
cse    female 17   prasanna    730
              18    keerthi    630
              30       jaga    233
ece    female 19      venky    427
       male   27      madhu    345
mech   male   13       gopi    574
                       name  phone
branch gender age
civil  female 15     aswini    908
cse    female 17   prasanna    730
              18    keerthi    630
              30       jaga    233
ece    female 19      venky    427
       male   27      madhu    345
mech   male   13       gopi    574
                   phone
branch gender age
civil  female 15     908
cse    female 17     730
              18     630
              30     233
ece    female 19     427
       male   27     345
mech   male   13     574
                   phone
branch gender age
civil  female 15   908.0
cse    female 17   730.0
              18   630.0
              30   233.0
ece    female 19   427.0
       male   27   345.0
mech   male   13   574.0

In [48]:
print(df.groupby(['gender']).get_group('female'))

       name  age  gender  phone branch
0      jaga   30  female    233    cse
1   keerthi   18  female    630    cse
2  prasanna   17  female    730    cse
3     venky   19  female    427    ece
4    aswini   15  female    908  civil

In [3]:
print(df.groupby(['gender','branch']).get_group(('female','cse')).value_counts())

name      age  gender  phone  branch
jaga      30   female  233    cse       1
keerthi   18   female  630    cse       1
prasanna  17   female  730    cse       1
dtype: int64

In [59]:

print(df.gender.value_counts())

female    5
male      2
Name: gender, dtype: int64

In [60]:
print(df.branch.value_counts())

cse      3
ece      2
civil    1
mech     1
Name: branch, dtype: int64

In [62]:
print(df.gender,branch.value_counts())

NameError: name 'branch' is not defined